## 06. Pandas
### 파일 입출력

In [1]:
import pandas as pd

In [ ]:
# csv 파일 불러오기
df = pd.read_csv("./dataset/practice_book_dataset.csv")
df.head()

In [6]:
# 데이터 정보 확인
df.shape
df.dtypes
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 19 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   title                         830 non-null    object
 1   author                        657 non-null    object
 2   price                         722 non-null    float64
 3   price (including used books)  722 non-null    object
 4   pages                         745 non-null    object
 5   avg_reviews                   702 non-null    float64
 6   n_reviews                     702 non-null    object
 7   star5                         702 non-null    object
 8   star4                         635 non-null    object
 9   star3                         554 non-null    object
 10  star2                         451 non-null    object
 11  star1                         328 non-null    object
 12  dimensions                    644 non-null    object
 13  weight                        651 non-null    object
 14  language                      759 non-null    object
 15  publisher                     714 non-null    object
 16  ISBN_13                       665 non-null    object
 17  link                          830 non-null    object
 18  complete_link                 830 non-null    object
dtypes: float64(2), object(17)
memory usage: 123.3+ KB

             price  avg_reviews
count   722.000000   702.000000
mean     46.491537     4.472080
std      63.292394     0.409608
min       0.990000     1.000000
25%      23.725000     4.325000
50%      39.490000     4.500000
75%      51.990000     4.700000
max    1318.740000     5.000000

In [8]:
df["title"].head(10)
df[["title", "author"]].head(10)

,title,author
0,Data Analysis Using R (Low Priced Edition): A ...,[ Dr Dhaval Maheta]
1,Head First Data Analysis: A learner's guide to...,NaN
2,Guerrilla Data Analysis Using Microsoft Excel:...,"[ Oz du Soleil, and , Bill Jelen]"
3,Python for Data Analysis: Data Wrangling with ...,[ William McKinney]
4,Excel Data Analysis For Dummies (For Dummies (...,[ Paul McFedries]
5,Everything Data Analytics: A Beginner's Guide ...,NaN
6,SQL for Data Analysis: Advanced Techniques for...,[ Cathy Tanimura]
7,Qualitative Data Analysis: A Methods Sourcebook,"[ Matthew B. Miles, A. Michael Huberman, et al.]"
8,Topological Data Analysis with Applications,"[ Gunnar Carlsson, and , Mikael Vejdemo-Johan..."
9,"R in Action, Third Edition: Data analysis and ...",[ Robert I. Kabacoff]

In [ ]:
mask = df["price"] >= 100
df[mask]
df.loc[mask, ["title", "price", "avg_reviews"]]

In [9]:
# csv 파일 저장
df2 = df.copy()
df2["library"] = "seoul library"
df2.to_csv("./dataset/new_book_dataset.csv")

In [ ]:
# excel 파일 불러오기
df = pd.read_excel("./dataset/practice_employee_dataset.xlsx")
df.head()

In [15]:
# excel(.xlsx) 파일로 저장
df2 = df.copy()
df2["Working Period"] = 3
df2.head(10)
df2.to_excel("./dataset/new_employee_dataset.xlsx")

In [23]:
df = pd.read_excel("./dataset/dataset2.xlsx")
df.head()

# 특정 시트 불러오기
df_sheet = pd.read_excel('./dataset/dataset2.xlsx', sheet_name='테스트')
df_sheet.head()

          에너지원별(1) 에너지원별(2) 에너지원별(3) 에너지원별(4)
0       총발전량 (MWh)       소계       소계       소계
1              NaN     양수발전       소계       소계
2  신재생에너지 공급비중 (%)       소계       소계       소계
3              NaN    재생에너지       소계       소계
4              NaN     신에너지       소계       소계

In [24]:
df = pd.read_json('./dataset/practice_json.json')
df.head()

,squadName,homeTown,formed,secretBase,active,members
0,Super hero squad,Metro City,2016,Super tower,True,"{'name': 'Molecule Man', 'age': 29, 'secretIde..."
1,Super hero squad,Metro City,2016,Super tower,True,"{'name': 'Madame Uppercut', 'age': 39, 'secret..."
2,Super hero squad,Metro City,2016,Super tower,True,"{'name': 'Eternal Flame', 'age': 1000000, 'sec..."